//******************************************************************************
// Имя файла    :  'Relay.h'
// Заголовок    :  Модуль переключателя
// Автор        :  Маньянов Р.Р.
// Контакты     :  
// Дата         :  17.07.2014
//******************************************************************************

#ifndef __RELAY_H
#define __RELAY_H

#include "GPIO/GPIO.h"

//==============================================================================
//                          Структуры и типы
//==============================================================================

    // Структура переключателя
    typedef struct 
    {
        sGpio*      gpio;       // пин управления переключателем
        uint8_t     onLevel;    // логический уровень включения (0 - включается при логическом нуле)
        
        uint32_t    startOn;    // начальное время включения        
        uint32_t    timeOn;     // продолжительность включения          
        uint32_t    periodOn;   // период включения, мс. (0 - мигать не нужно) 
    } sRelay;

//==============================================================================
//                      Прототипы функций
//==============================================================================

    // инициализация переключателя
    void RelayInit (sRelay* relay);     

    // обработка переключателя
    void RelayPoll (sRelay* relay);

    // Включение на определённый промежуток времени
    void RelaySetTimeOn (uint32_t time, sRelay* relay);

    // Задание периодического включения переключателя
    void RelaySetPeriodOn (uint32_t time, uint32_t period, sRelay* relay);
        
    // Включение переключателя
    void RelayOn (sRelay* relay);

    // Выключение переключателя
    void RelayOff (sRelay* relay);

#endif //__RELAY_H