//******************************************************************************
// Имя файла    :  'Relay.c'
// Заголовок    :  Модуль переключателя
// Автор        :  Маньянов Р.Р.
// Контакты     :  
// Дата         :  17.07.2014
//******************************************************************************

#include "Relay.h"

//==============================================================================
//                      Глобальные переменные
//==============================================================================  
    
    // внешне определённые переменные
    extern uint32_t globalTimer;
    extern sGpio    gpioLed1,
                    gpioLed2,
                    gpioLed3,
                    gpioLed4;
    
    
    // светодиод 1
    sRelay led1 =
    {
        .gpio       = &gpioLed1,  
        .onLevel    = 1,
    };

    // светодиод 2
    sRelay led2 =
    {
        .gpio       = &gpioLed2, 
        .onLevel    = 1,
    };
    
    // светодиод 3
    sRelay led3 =
    {
        .gpio       = &gpioLed3,  
        .onLevel    = 1,
    };
    
    // светодиод 4
    sRelay led4 =
    {
        .gpio       = &gpioLed4,  
        .onLevel    = 1,
    };
    
//==============================================================================
//                      Прототипы функций
//==============================================================================  
    
    // выключение процесса управления переключателем
    void RelayProcessOff (sRelay* relay);
    
//==============================================================================
//                       Инициализация переключателя
//------------------------------------------------------------------------------
// relay - переключатель
//==============================================================================  

void RelayInit (sRelay* relay)
{
    GPIOInit(relay->gpio);
    GPIOWrite(!relay->onLevel, relay->gpio);
}   

//==============================================================================
//                       Обработка переключателя
//------------------------------------------------------------------------------
// relay - переключатель
//==============================================================================  

void RelayPoll (sRelay* relay)
{    
    // если задан период включения
    if(relay->periodOn)
    {
        // если пришло время нового периода включения
        if(globalTimer - relay->startOn >= relay->periodOn)
        {
            relay->startOn  = globalTimer;
            GPIOWrite(relay->onLevel, relay->gpio); 
        }
        // если время включения в этом периоде вышло
        else if(globalTimer - relay->startOn >= relay->timeOn)
            GPIOWrite(!relay->onLevel, relay->gpio); 
    }
    
    // если задано время включения
    else if(relay->timeOn)
        // если время включения вышло
        if((globalTimer - relay->startOn) >= relay->timeOn)
        {
            GPIOWrite(!relay->onLevel, relay->gpio);   
            relay->timeOn = 0;
        }
}   

//==============================================================================
//               Задание периодического включения переключателя
//------------------------------------------------------------------------------
// time     - время включения (мс)
// period   - период (мс)
// relay    - переключатель 
//------------------------------------------------------------------------------
// Период должен быть больше времени включения. Например при установленном 
// периоде равном 1000 мс, и времени включения равном 100 мс, переключатель будет 
// включаться на 100 мс, затем выключаться на 900 мс и так по кругу, пока не будет 
// запущен другой режим работы. Если при вызове этой функции переключатель 
// уже в режиме периодического включения, то устанавливаются новые временые 
// характеристики, при этом период не начаинается с начала 
//============================================================================== 

void RelaySetPeriodOn (uint32_t time, uint32_t period, sRelay* relay)
{
    // если время включения меньше всего периода
    if(time < period)
    {
        // если до этого переключатель не был в данном режиме
        if(!relay->periodOn)
            GPIOWrite(relay->onLevel, relay->gpio);
        
        relay->timeOn   = time;
        relay->periodOn = period;
    }    
}

//==============================================================================
//                  Включение на определённый промежуток времени
//------------------------------------------------------------------------------
// time     - длительность включения (мс)
// relay    - переключатель
//------------------------------------------------------------------------------
// По истичении заданого промежутка времени переключатель выключается
//============================================================================== 

void RelaySetTimeOn (uint32_t time, sRelay* relay)
 {
     relay->startOn    = globalTimer;
     relay->timeOn     = time;
     GPIOWrite(relay->onLevel, relay->gpio);   
 }

//==============================================================================
//                       Включение переключателя
//------------------------------------------------------------------------------
// relay - переключатель
//============================================================================== 

void RelayOn (sRelay* relay)
{
    RelayProcessOff(relay);
    GPIOWrite(relay->onLevel, relay->gpio);     
}

//==============================================================================
//                          Выключение переключателя
//------------------------------------------------------------------------------
// relay - переключатель
//============================================================================== 

void RelayOff (sRelay* relay)
{
    RelayProcessOff(relay);
    GPIOWrite(!relay->onLevel, relay->gpio);   
}

//==============================================================================
//              Выключение моргания и свечения светодиода
//==============================================================================

static void RelayProcessOff (sRelay* relay)
{
    relay->timeOn     = 0;
    relay->periodOn   = 0;
    relay->startOn    = 0;
}
  